//JCLTEST1 JOB (035D),
//        'USER',
//        CLASS='A',
//        PRTY=6,NOTIFY=&SYSUID
//****************
//STEP01 EXEC PGM=COBTEST1
//SYSIN      DD *
20160230
20160229
20161312
20161332
20160431
20170229
20171312
20171232
20170431
20170520
/*
